virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/mpddrc.h
#define MPDDRC_MD_RL_Pos                      _U_(7)                                               /**< (MPDDRC_MD Position) Read Latency 3 Option Support (read-only) */
#define MPDDRC_MD_RL_Msk                      (_U_(0x1) << MPDDRC_MD_RL_Pos)                       /**< (MPDDRC_MD Mask) RL */
#define MPDDRC_MD_RL(value)                   (MPDDRC_MD_RL_Msk & ((value) << MPDDRC_MD_RL_Pos))   

/* -------- MPDDRC_LPDDR23_LPR : (MPDDRC Offset: 0x28) (R/W 32) Low-power DDR2 Low-power DDR3 Low-power Register -------- */
#define MPDDRC_LPDDR23_LPR_BK_MASK_PASR_Pos   _U_(0)                                               /**< (MPDDRC_LPDDR23_LPR) Bank Mask Bit/PASR Position */
#define MPDDRC_LPDDR23_LPR_BK_MASK_PASR_Msk   (_U_(0xFF) << MPDDRC_LPDDR23_LPR_BK_MASK_PASR_Pos)   /**< (MPDDRC_LPDDR23_LPR) Bank Mask Bit/PASR Mask */
#define MPDDRC_LPDDR23_LPR_BK_MASK_PASR(value) (MPDDRC_LPDDR23_LPR_BK_MASK_PASR_Msk & ((value) << MPDDRC_LPDDR23_LPR_BK_MASK_PASR_Pos))
#define MPDDRC_LPDDR23_LPR_SEG_MASK_Pos       _U_(8)                                               /**< (MPDDRC_LPDDR23_LPR) Segment Mask Bit Position */
#define MPDDRC_LPDDR23_LPR_SEG_MASK_Msk       (_U_(0xFFFF) << MPDDRC_LPDDR23_LPR_SEG_MASK_Pos)     /**< (MPDDRC_LPDDR23_LPR) Segment Mask Bit Mask */
#define MPDDRC_LPDDR23_LPR_SEG_MASK(value)    (MPDDRC_LPDDR23_LPR_SEG_MASK_Msk & ((value) << MPDDRC_LPDDR23_LPR_SEG_MASK_Pos))
#define MPDDRC_LPDDR23_LPR_DS_Pos             _U_(24)                                              /**< (MPDDRC_LPDDR23_LPR) Drive Strength Position */
#define MPDDRC_LPDDR23_LPR_DS_Msk             (_U_(0xF) << MPDDRC_LPDDR23_LPR_DS_Pos)              /**< (MPDDRC_LPDDR23_LPR) Drive Strength Mask */
#define MPDDRC_LPDDR23_LPR_DS(value)          (MPDDRC_LPDDR23_LPR_DS_Msk & ((value) << MPDDRC_LPDDR23_LPR_DS_Pos))
#define   MPDDRC_LPDDR23_LPR_DS_DS_34_3_Val   _U_(0x1)                                             /**< (MPDDRC_LPDDR23_LPR) 34.3 ohm typical  */
#define   MPDDRC_LPDDR23_LPR_DS_DS_40_Val     _U_(0x2)                                             /**< (MPDDRC_LPDDR23_LPR) 40 ohm typical (default)  */
#define   MPDDRC_LPDDR23_LPR_DS_DS_48_Val     _U_(0x3)                                             /**< (MPDDRC_LPDDR23_LPR) 48 ohm typical  */
#define   MPDDRC_LPDDR23_LPR_DS_DS_60_Val     _U_(0x4)                                             /**< (MPDDRC_LPDDR23_LPR) 60 ohm typical  */
#define   MPDDRC_LPDDR23_LPR_DS_DS_80_Val     _U_(0x6)                                             /**< (MPDDRC_LPDDR23_LPR) 80 ohm typical  */
#define   MPDDRC_LPDDR23_LPR_DS_DS_120_Val    _U_(0x7)                                             /**< (MPDDRC_LPDDR23_LPR) 120 ohm typical  */
#define MPDDRC_LPDDR23_LPR_DS_DS_34_3         (MPDDRC_LPDDR23_LPR_DS_DS_34_3_Val << MPDDRC_LPDDR23_LPR_DS_Pos) /**< (MPDDRC_LPDDR23_LPR) 34.3 ohm typical Position  */
#define MPDDRC_LPDDR23_LPR_DS_DS_40           (MPDDRC_LPDDR23_LPR_DS_DS_40_Val << MPDDRC_LPDDR23_LPR_DS_Pos) /**< (MPDDRC_LPDDR23_LPR) 40 ohm typical (default) Position  */
#define MPDDRC_LPDDR23_LPR_DS_DS_48           (MPDDRC_LPDDR23_LPR_DS_DS_48_Val << MPDDRC_LPDDR23_LPR_DS_Pos) /**< (MPDDRC_LPDDR23_LPR) 48 ohm typical Position  */
#define MPDDRC_LPDDR23_LPR_DS_DS_60           (MPDDRC_LPDDR23_LPR_DS_DS_60_Val << MPDDRC_LPDDR23_LPR_DS_Pos) /**< (MPDDRC_LPDDR23_LPR) 60 ohm typical Position  */
#define MPDDRC_LPDDR23_LPR_DS_DS_80           (MPDDRC_LPDDR23_LPR_DS_DS_80_Val << MPDDRC_LPDDR23_LPR_DS_Pos) /**< (MPDDRC_LPDDR23_LPR) 80 ohm typical Position  */
#define MPDDRC_LPDDR23_LPR_DS_DS_120          (MPDDRC_LPDDR23_LPR_DS_DS_120_Val << MPDDRC_LPDDR23_LPR_DS_Pos) /**< (MPDDRC_LPDDR23_LPR) 120 ohm typical Position  */
#define MPDDRC_LPDDR23_LPR_Msk                _U_(0x0FFFFFFF)                                      /**< (MPDDRC_LPDDR23_LPR) Register Mask  */


/* -------- MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4 : (MPDDRC Offset: 0x2C) (R/W 32) Low-power DDR2 Low-power DDR3 and DDR3 Calibration and MR4 Register -------- */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_COUNT_CAL_Pos _U_(0)                                               /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4) LPDDR2 LPDDR3 and DDR3 Calibration Timer Count Position */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_COUNT_CAL_Msk (_U_(0xFFFF) << MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_COUNT_CAL_Pos) /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4) LPDDR2 LPDDR3 and DDR3 Calibration Timer Count Mask */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_COUNT_CAL(value) (MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_COUNT_CAL_Msk & ((value) << MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_COUNT_CAL_Pos))
#define MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_MR4_READ_Pos _U_(16)                                              /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4) Mode Register 4 Read Interval Position */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_MR4_READ_Msk (_U_(0xFFFF) << MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_MR4_READ_Pos) /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4) Mode Register 4 Read Interval Mask */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_MR4_READ(value) (MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_MR4_READ_Msk & ((value) << MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_MR4_READ_Pos))
#define MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4_Msk _U_(0xFFFFFFFF)                                      /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_CAL_MR4) Register Mask  */


/* -------- MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL : (MPDDRC Offset: 0x30) (R/W 32) Low-power DDR2 Low-power DDR3 and DDR3 Timing Calibration Register -------- */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_ZQCS_Pos _U_(0)                                               /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) ZQ Calibration Short Position */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_ZQCS_Msk (_U_(0xFF) << MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_ZQCS_Pos) /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) ZQ Calibration Short Mask */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_ZQCS(value) (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_ZQCS_Msk & ((value) << MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_ZQCS_Pos))
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_Pos _U_(16)                                              /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) Built-in Self-Test for RZQ Information (read-only) Position */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_Msk (_U_(0x3) << MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_Pos) /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) Built-in Self-Test for RZQ Information (read-only) Mask */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI(value) (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_Msk & ((value) << MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_Pos))
#define   MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_RZQ_NOT_SUPPORTED_Val _U_(0x0)                                             /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) RZQ self test not supported  */
#define   MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_ZQ_VDDCA_FLOAT_Val _U_(0x1)                                             /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) The ZQ pin can be connected to VDDCA or left floating.  */
#define   MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_ZQ_SHORTED_GROUND_Val _U_(0x2)                                             /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) The ZQ pin can be shorted to ground.  */
#define   MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_ZQ_SELF_TEST_OK_Val _U_(0x3)                                             /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) ZQ pin self test complete; no error condition detected  */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_RZQ_NOT_SUPPORTED (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_RZQ_NOT_SUPPORTED_Val << MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_Pos) /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) RZQ self test not supported Position  */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_ZQ_VDDCA_FLOAT (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_ZQ_VDDCA_FLOAT_Val << MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_Pos) /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) The ZQ pin can be connected to VDDCA or left floating. Position  */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_ZQ_SHORTED_GROUND (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_ZQ_SHORTED_GROUND_Val << MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_Pos) /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) The ZQ pin can be shorted to ground. Position  */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_ZQ_SELF_TEST_OK (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_ZQ_SELF_TEST_OK_Val << MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_RZQI_Pos) /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) ZQ pin self test complete; no error condition detected Position  */
#define MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL_Msk _U_(0x000300FF)                                      /**< (MPDDRC_LPDDR2_LPDDR3_DDR3_TIM_CAL) Register Mask  */


/* -------- MPDDRC_IO_CALIBR : (MPDDRC Offset: 0x34) (R/W 32) I/O Calibration Register -------- */
#define MPDDRC_IO_CALIBR_RDIV_Pos             _U_(0)                                               /**< (MPDDRC_IO_CALIBR) Resistor Divider, Output Driver Impedance Position */
#define MPDDRC_IO_CALIBR_RDIV_Msk             (_U_(0x7) << MPDDRC_IO_CALIBR_RDIV_Pos)              /**< (MPDDRC_IO_CALIBR) Resistor Divider, Output Driver Impedance Mask */
#define MPDDRC_IO_CALIBR_RDIV(value)          (MPDDRC_IO_CALIBR_RDIV_Msk & ((value) << MPDDRC_IO_CALIBR_RDIV_Pos))
#define   MPDDRC_IO_CALIBR_RDIV_RZQ_34_Val    _U_(0x1)                                             /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 34.3 ohms,DDR2/LPDDR1 serial impedance line: Not applicable  */
#define   MPDDRC_IO_CALIBR_RDIV_RZQ_40_RZQ_38_RZQ_37_RZQ_35_Val _U_(0x2)                                             /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 40 ohms,LPDDR3 serial impedance line = 38 ohms,DDR3 serial impedance line = 37 ohms,DDR2/LPDDR1 serial impedance line = 35 ohms  */
#define   MPDDRC_IO_CALIBR_RDIV_RZQ_48_RZQ_46_RZQ_44_RZQ_43_Val _U_(0x3)                                             /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 48 ohms,LPDDR3 serial impedance line = 46 ohms,DDR3 serial impedance line = 44 ohms,DDR2/LPDDR1 serial impedance line = 43 ohms  */
#define   MPDDRC_IO_CALIBR_RDIV_RZQ_60_RZQ_57_RZQ_55_RZQ_52_Val _U_(0x4)                                             /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 60 ohms,LPDDR3 serial impedance line = 57 ohms,DDR3 serial impedance line = 55 ohms,DDR2/LPDDR1 serial impedance line = 52 ohms  */
#define   MPDDRC_IO_CALIBR_RDIV_RZQ_80_RZQ_77_RZQ_73_RZQ_70_Val _U_(0x6)                                             /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 80 ohms,LPDDR3 serial impedance line = 77 ohms,DDR3 serial impedance line = 73 ohms,DDR2/LPDDR1 serial impedance line = 70 ohms  */
#define   MPDDRC_IO_CALIBR_RDIV_RZQ_120_RZQ_115_RZQ_110_RZQ_105_Val _U_(0x7)                                             /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 120 ohms,LPDDR3 serial impedance line = 115 ohms,DDR3 serial impedance line = 110 ohms,DDR2/LPDDR1 serial impedance line = 105 ohms  */
#define MPDDRC_IO_CALIBR_RDIV_RZQ_34          (MPDDRC_IO_CALIBR_RDIV_RZQ_34_Val << MPDDRC_IO_CALIBR_RDIV_Pos) /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 34.3 ohms,DDR2/LPDDR1 serial impedance line: Not applicable Position  */
#define MPDDRC_IO_CALIBR_RDIV_RZQ_40_RZQ_38_RZQ_37_RZQ_35 (MPDDRC_IO_CALIBR_RDIV_RZQ_40_RZQ_38_RZQ_37_RZQ_35_Val << MPDDRC_IO_CALIBR_RDIV_Pos) /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 40 ohms,LPDDR3 serial impedance line = 38 ohms,DDR3 serial impedance line = 37 ohms,DDR2/LPDDR1 serial impedance line = 35 ohms Position  */
#define MPDDRC_IO_CALIBR_RDIV_RZQ_48_RZQ_46_RZQ_44_RZQ_43 (MPDDRC_IO_CALIBR_RDIV_RZQ_48_RZQ_46_RZQ_44_RZQ_43_Val << MPDDRC_IO_CALIBR_RDIV_Pos) /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 48 ohms,LPDDR3 serial impedance line = 46 ohms,DDR3 serial impedance line = 44 ohms,DDR2/LPDDR1 serial impedance line = 43 ohms Position  */
#define MPDDRC_IO_CALIBR_RDIV_RZQ_60_RZQ_57_RZQ_55_RZQ_52 (MPDDRC_IO_CALIBR_RDIV_RZQ_60_RZQ_57_RZQ_55_RZQ_52_Val << MPDDRC_IO_CALIBR_RDIV_Pos) /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 60 ohms,LPDDR3 serial impedance line = 57 ohms,DDR3 serial impedance line = 55 ohms,DDR2/LPDDR1 serial impedance line = 52 ohms Position  */
#define MPDDRC_IO_CALIBR_RDIV_RZQ_80_RZQ_77_RZQ_73_RZQ_70 (MPDDRC_IO_CALIBR_RDIV_RZQ_80_RZQ_77_RZQ_73_RZQ_70_Val << MPDDRC_IO_CALIBR_RDIV_Pos) /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 80 ohms,LPDDR3 serial impedance line = 77 ohms,DDR3 serial impedance line = 73 ohms,DDR2/LPDDR1 serial impedance line = 70 ohms Position  */
#define MPDDRC_IO_CALIBR_RDIV_RZQ_120_RZQ_115_RZQ_110_RZQ_105 (MPDDRC_IO_CALIBR_RDIV_RZQ_120_RZQ_115_RZQ_110_RZQ_105_Val << MPDDRC_IO_CALIBR_RDIV_Pos) /**< (MPDDRC_IO_CALIBR) LPDDR2 serial impedance line = 120 ohms,LPDDR3 serial impedance line = 115 ohms,DDR3 serial impedance line = 110 ohms,DDR2/LPDDR1 serial impedance line = 105 ohms Position  */
#define MPDDRC_IO_CALIBR_EN_CALIB_Pos         _U_(4)                                               /**< (MPDDRC_IO_CALIBR) Enable Calibration Position */
#define MPDDRC_IO_CALIBR_EN_CALIB_Msk         (_U_(0x1) << MPDDRC_IO_CALIBR_EN_CALIB_Pos)          /**< (MPDDRC_IO_CALIBR) Enable Calibration Mask */
#define MPDDRC_IO_CALIBR_EN_CALIB(value)      (MPDDRC_IO_CALIBR_EN_CALIB_Msk & ((value) << MPDDRC_IO_CALIBR_EN_CALIB_Pos))
#define   MPDDRC_IO_CALIBR_EN_CALIB_DISABLE_CALIBRATION_Val _U_(0x0)                                             /**< (MPDDRC_IO_CALIBR) Calibration is disabled.  */
#define   MPDDRC_IO_CALIBR_EN_CALIB_ENABLE_CALIBRATION_Val _U_(0x1)                                             /**< (MPDDRC_IO_CALIBR) Calibration is enabled.  */
#define MPDDRC_IO_CALIBR_EN_CALIB_DISABLE_CALIBRATION (MPDDRC_IO_CALIBR_EN_CALIB_DISABLE_CALIBRATION_Val << MPDDRC_IO_CALIBR_EN_CALIB_Pos) /**< (MPDDRC_IO_CALIBR) Calibration is disabled. Position  */
#define MPDDRC_IO_CALIBR_EN_CALIB_ENABLE_CALIBRATION (MPDDRC_IO_CALIBR_EN_CALIB_ENABLE_CALIBRATION_Val << MPDDRC_IO_CALIBR_EN_CALIB_Pos) /**< (MPDDRC_IO_CALIBR) Calibration is enabled. Position  */
#define MPDDRC_IO_CALIBR_TZQIO_Pos            _U_(8)                                               /**< (MPDDRC_IO_CALIBR) IO Calibration Position */
#define MPDDRC_IO_CALIBR_TZQIO_Msk            (_U_(0x7F) << MPDDRC_IO_CALIBR_TZQIO_Pos)            /**< (MPDDRC_IO_CALIBR) IO Calibration Mask */
#define MPDDRC_IO_CALIBR_TZQIO(value)         (MPDDRC_IO_CALIBR_TZQIO_Msk & ((value) << MPDDRC_IO_CALIBR_TZQIO_Pos))
#define MPDDRC_IO_CALIBR_CALCODEP_Pos         _U_(16)                                              /**< (MPDDRC_IO_CALIBR) Number of Transistor P (read-only) Position */
#define MPDDRC_IO_CALIBR_CALCODEP_Msk         (_U_(0xF) << MPDDRC_IO_CALIBR_CALCODEP_Pos)          /**< (MPDDRC_IO_CALIBR) Number of Transistor P (read-only) Mask */
#define MPDDRC_IO_CALIBR_CALCODEP(value)      (MPDDRC_IO_CALIBR_CALCODEP_Msk & ((value) << MPDDRC_IO_CALIBR_CALCODEP_Pos))
#define MPDDRC_IO_CALIBR_CALCODEN_Pos         _U_(20)                                              /**< (MPDDRC_IO_CALIBR) Number of Transistor N (read-only) Position */
#define MPDDRC_IO_CALIBR_CALCODEN_Msk         (_U_(0xF) << MPDDRC_IO_CALIBR_CALCODEN_Pos)          /**< (MPDDRC_IO_CALIBR) Number of Transistor N (read-only) Mask */
#define MPDDRC_IO_CALIBR_CALCODEN(value)      (MPDDRC_IO_CALIBR_CALCODEN_Msk & ((value) << MPDDRC_IO_CALIBR_CALCODEN_Pos))
#define MPDDRC_IO_CALIBR_Msk                  _U_(0x00FF7F17)                                      /**< (MPDDRC_IO_CALIBR) Register Mask  */


/* -------- MPDDRC_OCMS : (MPDDRC Offset: 0x38) (R/W 32) OCMS Register -------- */
#define MPDDRC_OCMS_SCR_EN_Pos                _U_(0)                                               /**< (MPDDRC_OCMS) Scrambling Enable Position */
#define MPDDRC_OCMS_SCR_EN_Msk                (_U_(0x1) << MPDDRC_OCMS_SCR_EN_Pos)                 /**< (MPDDRC_OCMS) Scrambling Enable Mask */
#define MPDDRC_OCMS_SCR_EN(value)             (MPDDRC_OCMS_SCR_EN_Msk & ((value) << MPDDRC_OCMS_SCR_EN_Pos))
#define MPDDRC_OCMS_Msk                       _U_(0x00000001)                                      /**< (MPDDRC_OCMS) Register Mask  */


